src/CFD/hotRoom/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    floor
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       1300;
    }
    ceiling
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       1400;
    }
    fixedWalls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       1500;
    }
)

// ************************************************************************* //
